/* 一普查员问一女人，"你有多少个孩子，他们多少岁?"
女人回答:"我有三个孩子，他们的岁数相乘是36，岁数相加就就等于旁边屋的门牌号
码。"普查员立刻走到旁边屋，看一看，回来说:"我还需要一些资料。"女人回答:"我
现在很忙，最大的孩子在楼上睡觉。"普查员说:"谢谢，我已知道了。"
问题:那三个孩子的岁数分别是多少?(需要给出逻辑推理过程) */

#include <stdio.h>
int main(void)
{
	int x, y, z;

	for (x = 1; x < 36; x++)
	{
		for (y = 1; y < 36; y++)
		{
			z = 36 / x / y;
			if (x * y * z == 36 && x <= y && y <= z)
			{
				printf("x = %d, y = %d, z = %d, ", x, y, z);
				printf("sum = %d\n", x + y + z);
			}
		}
	}

	return 0;
}

/*
结果: 2岁、2岁、9岁
分析:
根据遍历结果，符合积为36的结果有8个，在普查员看了门牌号后说:"我还需要一些
资料"说明结果是不唯一的情况，那么只有和为 13 的两种可能。再根据女人回复"
最大的孩子在楼上睡觉"，可推断只有一个孩子最大，所以结果是2、2、9。
>>> Execution Result:
x = 1, y = 1, z = 36, sum = 38
x = 1, y = 2, z = 18, sum = 21
x = 1, y = 3, z = 12, sum = 16
x = 1, y = 4, z = 9, sum = 14
x = 1, y = 6, z = 6, sum = 13
x = 2, y = 2, z = 9, sum = 13
x = 2, y = 3, z = 6, sum = 11
x = 3, y = 3, z = 4, sum = 10
 */
