/* 方法二：
原来有x个，过1个村子后有x/2-1个，过2个村子后有(x/2-1)/2-1=x/4-3/2个，
过3个村子后有(x/4-3/2)/2-1=x/8-7/4个，......，（找规律）过n个村子后
有x/(2^n)-(2^n-1)/2^(n-1)。

原来有：x

过了1个村子剩有：x/2-1

过了2个村子剩有：x/4-3/2

过了3个村子剩有：x/8-7/x

......

过了n个村子剩有：x/(2^n)-(2^n-1)/2^(n-1)

过7个村子后的果数是2，得方程：x/(2^7)-((2^7-1)/2^6)=2 。
解方程得x=510。 */

#include <stdio.h>

int main(void)
{
	int x, i;

	// 引入浮点数64.0，避免整除，此法存在精度损失
	x = (2 + 127 / 64.0) * 128;
	printf("松鼠共采摘: %d 个松果。\n", x);
	printf("每经过一个村卖出:\n");
	for (i = 0; i < 7; i++)
		printf("第%d个村: %d\n", i + 1, x = x / 2 + 1);

	return 0;
}
